{
  "heading": "Frequently Asked Questions",
  "items": [
    {
      "q": "Is this accepted in my state?",
      "a": [
        "All courses we offer are approved for their corresponding state. Each state has different rules; we list approvals and any special instructions in the course details.",
        "If you're unsure, choose your state in the finder to view a list of all approved courses for your state."
      ]
    },
    {
      "q": "How long is the course?",
      "a": [
        "Most courses are 4–6 hours. The exact duration is shown on the course page near the top.",
        "You can take it at your own pace—start/stop anytime and your progress is saved."
      ]
    },
    {
      "q": "How do I get my certificate?",
      "a": [
        "Certificates are issued immediately upon completion. You can download your digital certificate right away.",
        "",
        "- <strong>Road Ready courses</strong>: we also automatically report your completion electronically to the Florida DHSMV, as required.",
        "- <strong>TicketSchool courses</strong>, delivery and reporting vary by state:",
        "  - <strong>Florida (Basic Driver Improvement)</strong> – reported electronically to DHSMV.",
        "  - <strong>Florida (8-hour Intermediate)</strong>, <strong>Texas</strong>, <strong>Louisiana</strong>, <strong>Tennessee</strong>, and similar states – certificate is available via download/email, and you are responsible for submitting it; <strong>no electronic reporting</strong> by TicketSchool.",
        "  - <strong>Virginia</strong>, <strong>New York</strong> (if license entered), and <strong>Michigan</strong> – TicketSchool reports completion electronically to the DMV/SOS; you may still need to submit the certificate depending on court or insurance requirements."
      ]
    },
    {
      "q": "Will this dismiss my ticket or remove points?",
      "a": [
        "If the course is taken for ticket dismissal or point reduction, follow the instructions on the course page.",
        "Some courts require you to notify them after completion. We'll tell you when that applies."
      ]
    },
    {
      "q": "Can I use my phone?",
      "a": [
        "Absolutely. The course works on phone, tablet, or desktop.",
        "Your progress is auto-saved so you can switch devices anytime."
      ]
    },
    {
      "q": "What languages are available?",
      "a": [
        "Language options vary by course and state. Use the Language filter on the results page to see what's available."
      ]
    },
    {
      "q": "How do refunds work?",
      "a": [
        "If you haven't completed the course and need a refund, contact Support. Refund eligibility may vary by provider/state requirements."
      ]
    },
    {
      "q": "How do I contact support?",
      "a": [
        "Visit the Help Center for 24/7 email support and phone support during business hours.",
        "We aim to reply within 24 hours."
      ]
    },
    {
      "q": "Who is TicketSchool?",
      "a": [
        "TicketSchool is a state-approved provider we partner with. They have been providing courses for over 35 years. For these courses, checkout happens on TicketSchool's secure site.",
        "Completion reporting/certificates follow the rules on the course page."
      ]
    },
    {
      "q": "How do I log back in?",
      "a": [
        "Use the same email you used at checkout. If you enrolled with a partner course, you'll log in on their site.",
        "For in-house courses, use the login link in your confirmation email."
      ]
    },
    {
      "q": "When do I get my certificate?",
      "a": [
        "Certificates are issued immediately upon completion. The delivery method varies depending on the course; it will either be mailed or delivered electronically.",
        "Some states also support electronic reporting to the DMV/court; when available, we'll note it on the course page."
      ]
    },
    {
      "q": "Is my completion reported to the court/DMV?",
      "a": [
        "Where electronic reporting is available, completion is sent automatically to the state/court.",
        "If not available, you may need to submit proof yourself. Check your course page for specific instructions."
      ]
    },
    {
      "q": "What's your refund policy?",
      "a": [
        "Refund eligibility varies by provider and state requirements. Look for Ticket School's refund policy for the course you're interested in"
      ]
    },
    {
      "q": "What devices and browsers are supported?",
      "a": [
        "The course works on phone, tablet, or desktop. We support Chrome, Edge, Safari, and Firefox.",
        "Your progress is auto-saved so you can switch devices anytime."
      ]
    },
    {
      "q": "How long does the course actually take?",
      "a": [
        "Most courses are 4–6 hours of actual learning time. The exact duration is shown on the course page.",
        "You can take it at your own pace. Start and stop anytime; your progress is saved."
      ]
    },
    {
      "q": "What if I made a mistake choosing my state/course?",
      "a": [
        "Contact Support immediately with your order details. We can often help switch you to the correct course.",
        "If you haven't started, we can usually make the change without additional cost."
      ]
    }
  ]
}